<?php

use App\Models\University;
use Illuminate\Database\Seeder;

class UniversitySeeder extends Seeder
{
   
    public function run()
    {
        $names=[
           'جامعة أم القرى',
           ' الجامعة الإسلامية' ,
           'جامعة الإمام محمد بن سعود الإسلامية',
           'جامعة الملك عبد العزيز',
           'جامعة الملك سعود',
           'جامعة الملك فهد للبترول والمعادن ',
           'جامعة نايف العربية للعلوم الأمنية',
           ' جامعة الملك فيصل',
           ' جامعة الملك خالد',
           'جامعة القصيم',
           'جامعة طيبة',
           'جامعة الطائف',
           'جامعة حائل',
           'جامعة جازان',
           'جامعة الجوف',
           'جامعة الباحة',
           'جامعة تبوك',
           'جامعة نجران',
           'جامعة الحدود الشمالية',
           'جامعة الأميرة نورة بنت عبد الرحمن',
           'جامعة الملك سعود بن عبد العزيز للعلوم الصحية',
           'جامعة الإمام عبد الرحمن بن فيصل',
           'جامعة الملك عبد الله للعلوم والتقنية',
           'جامعة الأمير سطام بن عبد العزيز',
           'جامعة شقراء',
           'جامعة المجمعة',
           'الجامعة السعودية الالكترونية',
           'جامعة جدة',
           'جامعة بيشة',
           'كلية المدربين التقنيين',
           'جامعة حفر الباطن',
           'كلية الجبيل الصناعية',
           'كلية ينبع الصناعية',
           'كلية ينبع الجامعية',


           'كلية الأمير محمد بن سلمان للإدارة وريادة الأعمال',
           'جامعة رياض العلم',
           'جامعة المستقبل',
           'جامعة سليمان الراجحي الأهلية',
           'كلية ابن سينا للعلوم الطبية',
           'كلية البترجي للعلوم الطبية والتقنية',
           'كليات الفارابي الأهلية',
           'كلية المعرفة',
           'كليات الرياض لطب الاسنان والصيدلة',
           'جامعة دار الحكمة',
           'جامعة الأمير مقرن بن عبد العزيز',
           'جامعة دار العلوم',
           'جامعة الأمير سلطان',
           'جامعة عفت الأهلية',
           'الجامعة العربية المفتوحة',
           'جامعة اليمامة',
           'جامعة الأمير فهد بن سلطان',
           'جامعة الأمير محمد بن فهد',
           'جامعة الأعمال والتكنولوجيا',
           'جامعة الفيصل',
           'كلية جدة العالمية',
           'كليات الريان الأهلية',
           'كليات الخليج',
           'كلية لينكون',
           'جامعة الأصالة',
           'الأكاديمية السعودية للطيران المدني',
           'أكاديمية الأمير سلطان لعلوم الطيران',
           'كلية الملك عبد العزيز الحربية',
           'كلية الملك فهد الأمنية',
           'كلية الملك فيصل الجوية',
           'كلية الملك خالد العسكرية',
           'كلية الملك فهد البحرية',
           'كلية الملك عبد الله للدفاع الجوي',
           'مركز ومدرسة قوة الصواريخ الاستراتيجية',
        ];

        University::truncate();
        for($d=0;$d<sizeof($names);$d++){
            University::create([
                'title' => $names[$d],
                'sort'  =>$d,
                'status'=>1,
            ]);
        }
    }
}
