<?php

return [
    "classification" => [
        33 => [
            'mail'       => [
                'subject' => 'عزيزي :Name',
                'content' => 'عزيزي :Name، تعذر علينا الاتصال بك لمتابعة طلب التمويل العقاري الخاص بك،
لخدمتك بشكل أسرع يرجى تحميل تطبيقنا وتواصل مباشرة مع مستشارك
وتابع حالة طلبك أولًا بأول
حمل من متجر أبل عبر الرابط التالي
:appStoreUrl
لأجهزة اندروبد عبر الرابط التالي
:googlePlayUrl',
            ],
            'push_token' => [
                'subject' => 'عزيزي :Name',
                'content' => 'عزيزي :Name، تعذر علينا الاتصال بك لمتابعة طلب التمويل العقاري الخاص بك،
لخدمتك أسرع يمكنك التواصل مع مستشارك الخاص بك',
            ],
            'sms'        => [
                'subject' => 'عزيزي :Name',
                'content' => 'عزيزي :Name، تعذر علينا الاتصال بك لمتابعة طلبك،
لخدمتك بشكل أسرع يرجى تحميل تطبيقنا
عبر الرابط التالي :appDownload',
            ],
        ],
        72 => [
            'mail'       => [
                'subject' => 'عزيزي :Name',
                'content' => 'عزيزي :Name، تعذر علينا الاتصال بك لمتابعة طلب التمويل العقاري الخاص بك،
لخدمتك بشكل أسرع يرجى تحميل تطبيقنا وتواصل مباشرة مع مستشارك
وتابع حالة طلبك أولًا بأول
حمل من متجر أبل عبر الرابط التالي
:appStoreUrl
لأجهزة اندروبد عبر الرابط التالي
:googlePlayUrl',
            ],
            'push_token' => [
                'subject' => 'عزيزي :Name',
                'content' => 'عزيزي :Name، تعذر علينا الاتصال بك لمتابعة طلب التمويل العقاري الخاص بك،
لخدمتك أسرع يمكنك التواصل مع مستشارك الخاص بك',
            ],
            'sms'        => [
                'subject' => 'عزيزي :Name',
                'content' => 'عزيزي :Name، تعذر علينا الاتصال بك لمتابعة طلبك،
لخدمتك بشكل أسرع يرجى تحميل تطبيقنا
عبر الرابط التالي :appDownload',
            ],
        ],
    ],

    62 => [
        'mail'       => [
            'subject' => 'عزيزي :Name',
            'content' => 'عزيزي :Name، طلبت تأجيل التواصل لمتابعة طلب التمويل العقاري الخاص بك،
لخدمتك بشكل أسرع يرجى تحميل تطبيقنا وتواصل مباشرة مع مستشارك
وتابع حالة طلبك أولًا بأول
حمل من متجر أبل عبر الرابط التالي
:appStoreUrl
لأجهزة اندروبد عبر الرابط التالي
:googlePlayUrl',
        ],
        'push_token' => [
            'subject' => 'عزيزي :Name',
            'content' => 'عزيزي :Name، طلبت تأجيل التواصل لمتابعة طلب التمويل العقاري الخاص بك،
لخدمتك أسرع يمكنك التواصل مع مستشارك الخاص بك',
        ],
        'sms'        => [
            'subject' => 'عزيزي :Name',
            'content' => 'عزيزي :Name، طلبت تأجيل التواصل لمتابعة طلبك،
لخدمتك بشكل أسرع يرجى تحميل تطبيقنا
عبر الرابط التالي :appDownload',
        ],
    ],
];
